[
  {
    "id": "act1-title",
    "title": "The Marketing Campaign Lifecycle",
    "narration": "",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 800
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-title-slide",
    "duration": 5000
  },
  {
    "id": "act1-lifecycle",
    "title": "The Marketing Lifecycle",
    "narration": "Every marketing team draws this on a whiteboard — the clean, linear pipeline from brief to publish. In reality, this map is a lie of omission. It hides the 60% of time spent on rework, the approval cycles that kill velocity, and the tribal knowledge that walks out the door every time someone leaves. The question isn't whether the process works. It's how much it costs when it breaks.",
    "cameraPosition": {
      "x": -60,
      "y": 30,
      "z": 380
    },
    "cameraLookAt": {
      "x": -60,
      "y": 30,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-teams-by-phase",
    "filterNodeTypes": [
      "step"
    ],
    "highlightLinkTypes": [
      "flows-to"
    ],
    "duration": 15000
  },
  {
    "id": "act1-pain-points",
    "title": "Where the Pipeline Breaks",
    "narration": "At enterprise scale, this pipeline breaks in predictable ways. Twenty percent of content gets reworked because the brief was ambiguous. Approval cycles average seven business days because reviewers lack context. Sixty percent of marketer time goes to administrative coordination, not strategic work. These aren't efficiency problems — they're structural failures baked into a linear model that doesn't match how work actually flows.",
    "cameraPosition": {
      "x": 0,
      "y": 200,
      "z": 800
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-process-chart",
    "duration": 8000
  },
  {
    "id": "act2-agents-and-context",
    "title": "Adding Agents — And What They Actually Need",
    "narration": "The first instinct is to bolt AI agents onto the existing pipeline — an agent for research, another for drafting, one for SEO. This gets results fast: first-draft generation drops from hours to minutes. But it also creates a new problem. Without shared context, each agent operates in isolation. The research agent doesn't know what the brand guide says. The SEO agent doesn't know what the compliance team flagged last quarter. Speed without coherence just produces more content to fix.",
    "cameraPosition": {
      "x": -100,
      "y": -80,
      "z": 700
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-teams-by-phase",
    "filterNodeTypes": [
      "step"
    ],
    "highlightLinkTypes": [
      "flows-to"
    ],
    "duration": 25000
  },
  {
    "id": "act3-graph-reveal",
    "title": "It's Not a Pipeline — It's a Graph",
    "narration": "This is what the process actually looks like. Not a pipeline — a network. Every step connects to review gates, knowledge inputs, agent capabilities, and feedback loops. The complexity isn't a bug; it's the reality of enterprise content production at scale. The organizations that perform aren't the ones that simplify this away. They're the ones that build intelligence to navigate it.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 500
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 4000,
    "graphState": "full-graph",
    "action": "explode-to-graph",
    "duration": 12000
  },
  {
    "id": "act3-feedback-loops",
    "title": "Feedback Loops and Revision Cycles",
    "narration": "The arrows flowing backward are the real story. Every review gate can send work back for revision. Every escalation pulls a human into the loop. Every performance measurement feeds forward into the next campaign's planning. These feedback loops are where quality happens — and where most organizations lose time. The difference between a 2-week campaign cycle and a 6-week one is almost entirely determined by how many times content loops through revision.",
    "cameraPosition": {
      "x": -50,
      "y": 100,
      "z": 500
    },
    "cameraTransitionMs": 2500,
    "graphState": "full-graph",
    "action": "show-feedback-loops",
    "duration": 8000
  },
  {
    "id": "act4-intelligence-layer",
    "title": "The Intelligence Layer",
    "narration": "The intelligence layer is what separates agents that hallucinate from agents that perform. Brand voice guides, audience personas, compliance rules, performance data — these aren't nice-to-have context. They're the operational substrate that every agent depends on for every decision. When this layer is incomplete or stale, agent output degrades. When it's well-maintained, it compounds — every new piece of organizational knowledge makes every agent more capable.",
    "cameraPosition": {
      "x": 60,
      "y": 0,
      "z": 500
    },
    "cameraLookAt": {
      "x": 60,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-intelligence-vs-agents",
    "filterNodeTypes": [
      "input",
      "agent"
    ],
    "highlightLinkTypes": [
      "uses",
      "performs"
    ],
    "duration": 25000
  },
  {
    "id": "act5-human-roles",
    "title": "Human-in-the-Loop as Design Principle",
    "narration": "Human-in-the-loop isn't a safety net — it's a design principle. Every gate in this graph represents a point where human judgment is irreplaceable: brand exceptions that require taste, legal ambiguities that require interpretation, strategic pivots that require context no model has. The pattern that works isn't AI replacing humans or humans supervising AI. It's a clear contract: agents handle volume and velocity, humans handle judgment and accountability.",
    "cameraPosition": {
      "x": 0,
      "y": -60,
      "z": 480
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-human-roles",
    "duration": 15000
  },
  {
    "id": "act5-operating-model",
    "title": "The Operating Model Shift",
    "narration": "The shift isn't from manual to automated. It's from a team of specialists executing tasks to a team of orchestrators directing systems. Content directors become workflow architects. Brand managers become governance designers. Analytics leads become feedback loop engineers. Every role in the graph transforms — not by doing less, but by operating at a higher altitude. The organizations that understand this are already redesigning their operating models around the graph, not around the org chart.",
    "cameraPosition": {
      "x": 100,
      "y": -50,
      "z": 600
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-role-overview",
    "duration": 8000
  },
  {
    "id": "act6-close",
    "title": "The Strategic Thesis",
    "narration": "The thesis is simple. Agents will commoditize — the cost of generating content, optimizing media, and scoring performance will approach zero. What won't commoditize is the organizational intelligence that makes those agents effective: the knowledge graph, the governance rules, the feedback loops, the escalation logic. The organizations building that intelligence layer now are creating a compounding advantage. The ones waiting for agents to get smarter are renting capability they'll never own.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 520
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-operating-model",
    "duration": 15000
  }
]
