[
  {
    "id": "act1-title",
    "title": "The Marketing Campaign Lifecycle",
    "narration": "",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 800
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-title-slide",
    "duration": 5000
  },
  {
    "id": "act1-lifecycle",
    "title": "The Marketing Lifecycle",
    "narration": "Every marketing team draws this on a whiteboard — the clean, linear pipeline from brief to publish. In reality, this map is a lie of omission. It hides the 60% of time spent on rework, the approval cycles that kill velocity, and the tribal knowledge that walks out the door every time someone leaves. The question isn't whether the process works. It's how much it costs when it breaks.",
    "cameraPosition": {
      "x": -60,
      "y": 30,
      "z": 380
    },
    "cameraLookAt": {
      "x": -60,
      "y": 30,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-teams-by-phase",
    "filterNodeTypes": [
      "step"
    ],
    "highlightLinkTypes": [
      "flows-to"
    ],
    "duration": 15000
  },
  {
    "id": "act2-agents-and-context",
    "title": "Adding Agents — And What They Actually Need",
    "narration": "The first instinct is to bolt AI agents onto the existing pipeline — an agent for research, another for drafting, one for SEO. This gets results fast: first-draft generation drops from hours to minutes. But it also creates a new problem. Without shared context, each agent operates in isolation. The research agent doesn't know what the brand guide says. The SEO agent doesn't know what the compliance team flagged last quarter. Speed without coherence just produces more content to fix.",
    "cameraPosition": {
      "x": -100,
      "y": -80,
      "z": 700
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-teams-by-phase",
    "filterNodeTypes": [
      "step"
    ],
    "highlightLinkTypes": [
      "flows-to"
    ],
    "duration": 25000
  },
  {
    "id": "act1-pain-points",
    "title": "Where the Pipeline Breaks",
    "narration": "At enterprise scale, this pipeline breaks in predictable ways. Twenty percent of content gets reworked because the brief was ambiguous. Approval cycles average seven business days because reviewers lack context. Sixty percent of marketer time goes to administrative coordination, not strategic work. These aren't efficiency problems — they're structural failures baked into a linear model that doesn't match how work actually flows.",
    "cameraPosition": {
      "x": 0,
      "y": 200,
      "z": 800
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-process-chart",
    "duration": 8000
  },
  {
    "id": "act3-graph-reveal",
    "title": "But Agents Have to Navigate the Real World",
    "narration": "This is what agents actually have to navigate. Not a clean pipeline — a network of review gates, knowledge inputs, agent capabilities, and feedback loops. The complexity isn't a bug; it's the reality of enterprise content production at scale. The organizations that perform aren't the ones that simplify this away. They're the ones that build intelligence to navigate it.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 500
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 4000,
    "graphState": "full-graph",
    "action": "explode-to-graph",
    "duration": 12000
  },
  {
    "id": "act4-intelligence-layer",
    "title": "The Intelligence Layer",
    "narration": "Every agent in this graph depends on the same foundation: brand voice guides, audience personas, compliance rules, performance data. This is the intelligence layer — the structured knowledge that tells agents what to say, who to say it to, and what boundaries to respect. Build this layer well, and every agent gets smarter. Neglect it, and agents hallucinate faster.",
    "cameraPosition": {
      "x": 60,
      "y": 0,
      "z": 500
    },
    "cameraLookAt": {
      "x": 60,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-intelligence-vs-agents",
    "filterNodeTypes": [
      "input",
      "agent"
    ],
    "highlightLinkTypes": [
      "uses",
      "performs"
    ],
    "duration": 20000
  },
  {
    "id": "act5-human-roles",
    "title": "Human-in-the-Loop as Design Principle",
    "narration": "Agents handle volume and velocity. Humans handle judgment and accountability. Every gate in this graph marks a point where human decision-making is irreplaceable — brand taste, legal interpretation, strategic direction.",
    "cameraPosition": {
      "x": 0,
      "y": -60,
      "z": 480
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-human-roles",
    "duration": 10000
  },
  {
    "id": "act5-operating-model",
    "title": "The Operating Model Shift",
    "narration": "The shift isn't from manual to automated — it's from executing tasks to orchestrating systems. Every role transforms: content directors become workflow architects, brand managers become governance designers.",
    "cameraPosition": {
      "x": 100,
      "y": -50,
      "z": 600
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-role-overview",
    "duration": 8000
  },
  {
    "id": "act6-close",
    "title": "The Path to Agentic Operations",
    "narration": "The path is clear: understand the process, map the intelligence layer, then build the foundation agents need to perform. Better models won't save you — better knowledge will. The organizations building that layer now are the ones whose agents will actually work.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 520
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-operating-model",
    "duration": 12000
  }
]
