[
  {
    "id": "act1-title",
    "title": "The Content Production Lifecycle",
    "narration": "",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 800
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-title-slide",
    "duration": 0
  },
  {
    "id": "act1-pipeline",
    "title": "The Pipeline Everyone Draws",
    "narration": "Every marketing team draws the same pipeline: Strategy, Create, Review, Publish, Measure, Optimize. Six stages, left to right. Clean columns. This is the version that lives in your process documentation and gets presented to leadership when someone asks how content gets made.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 450
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-linear-pipeline",
    "duration": 0
  },
  {
    "id": "act1-teams",
    "title": "The Teams Behind Each Phase",
    "narration": "Zoom into each phase and you find people. The Content Director owns the brief. Editors and brand managers own review. Marketing Ops runs distribution. Analytics closes the loop. Each phase has a team, and each team has a process. Thirty-one steps. Not six.",
    "cameraPosition": {
      "x": -60,
      "y": 30,
      "z": 380
    },
    "cameraLookAt": {
      "x": -60,
      "y": 30,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-teams-by-phase",
    "filterNodeTypes": [
      "step"
    ],
    "highlightLinkTypes": [
      "flows-to"
    ],
    "duration": 0
  },
  {
    "id": "act2-agents-appear",
    "title": "Where AI Agents Fit Today",
    "narration": "AI agents plug into specific steps. A Research Agent handles audience insights. A Content Writer drafts. A Performance Analyst measures results. Eleven agents total, each mapped to a specific task in the pipeline. This is where most organizations stop — bolting AI onto existing workflows to make each step a little faster.",
    "cameraPosition": {
      "x": 0,
      "y": -80,
      "z": 520
    },
    "cameraLookAt": {
      "x": 0,
      "y": -80,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-agents-on-pipeline",
    "filterNodeTypes": [
      "step",
      "agent"
    ],
    "highlightLinkTypes": [
      "performs"
    ],
    "duration": 0
  },
  {
    "id": "act2-context",
    "title": "What Agents Actually Depend On",
    "narration": "Every organization has brand guidelines, audience personas, legal frameworks, analytics data. Most teams treat these as reference material — documents that sit in a shared drive and get consulted when someone remembers they exist. But context is not the same as information. Context is how information actually governs decisions — who applies it, when it triggers a review, what breaks when it goes stale. That distinction changes everything about how you build an AI system.",
    "cameraPosition": {
      "x": 0,
      "y": -100,
      "z": 450
    },
    "cameraLookAt": {
      "x": 0,
      "y": -100,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-agent-dependencies",
    "filterNodeTypes": [
      "input"
    ],
    "highlightLinkTypes": [
      "uses"
    ],
    "duration": 0
  },
  {
    "id": "act3-reality",
    "title": "The Pipeline Is a Fiction",
    "narration": "Now watch what happens when we add the real structure. Gates create checkpoints between phases. Feedback loops send work back for revision. Escalation paths route exceptions upward. Competitive signals create fast-track paths that bypass the normal sequence. The neat columns dissolve. This is not a pipeline — it is a graph.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 550
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2500,
    "graphState": "full-graph",
    "action": "explode-to-graph",
    "duration": 0
  },
  {
    "id": "act3-governance",
    "title": "Governance and Learning",
    "narration": "Nine gates control the flow. Brief Approval checks strategic alignment before a word gets written. Legal Compliance gates regulatory risk before anything publishes. Each gate has auto-pass criteria and escalation triggers — not human-in-the-loop for everything, but human-at-the-gate for what matters. And the system learns. Performance data flows back to campaign planning. Governance findings trigger new content requests. Content that underperforms teaches the system what to change. Content that overperforms gets repurposed and amplified. The graph learns.",
    "cameraPosition": {
      "x": 0,
      "y": 50,
      "z": 420
    },
    "cameraLookAt": {
      "x": 0,
      "y": 50,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "highlight-gates",
    "filterNodeTypes": [
      "gate",
      "step"
    ],
    "highlightLinkTypes": [
      "reviews",
      "escalates-to",
      "returns-to"
    ],
    "duration": 0
  },
  {
    "id": "act4-infrastructure",
    "title": "The Infrastructure That Compounds",
    "narration": "Now look at the input layer. Twenty reference inputs — brand guides, audience personas, orchestration rules — connected to multiple agents and steps simultaneously. Every relationship is explicit. Every dependency is traceable. This is not supporting documentation. This is a knowledge graph. And it is the part that most organizations never build.",
    "cameraPosition": {
      "x": 0,
      "y": -60,
      "z": 400
    },
    "cameraLookAt": {
      "x": 0,
      "y": -60,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-knowledge-layer",
    "filterNodeTypes": [
      "input",
      "agent"
    ],
    "highlightLinkTypes": [
      "uses"
    ],
    "duration": 0
  },
  {
    "id": "act4-thesis",
    "title": "Agents Commoditize. Infrastructure Compounds.",
    "narration": "Here is the strategic insight. The agents are interchangeable — you can swap the Content Writer for a better model next quarter. Agents improve one step at a time. The knowledge graph improves the entire system simultaneously. Every time you refine a persona, every agent that references it gets better. The infrastructure compounds. The agents commoditize. That asymmetry is your competitive advantage.",
    "cameraPosition": {
      "x": 60,
      "y": 0,
      "z": 500
    },
    "cameraLookAt": {
      "x": 60,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-infrastructure-vs-agents",
    "filterNodeTypes": [
      "input",
      "agent"
    ],
    "highlightLinkTypes": [
      "uses",
      "performs"
    ],
    "duration": 0
  },
  {
    "id": "act5-elevation",
    "title": "Elevating Human Work",
    "narration": "This is not about making each person twenty percent faster at their current job. That is the small thinking. When agents handle drafting, compliance screening, and variant creation — what is left for humans? Strategy. Creative direction. Judgment calls at gates. The design of the system itself. The humans in this graph do not do less. They do different work — higher-leverage work that requires taste, accountability, and strategic context that cannot be reduced to a prompt.",
    "cameraPosition": {
      "x": 0,
      "y": 40,
      "z": 400
    },
    "cameraLookAt": {
      "x": 0,
      "y": 40,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-human-elevation",
    "filterNodeTypes": [
      "step",
      "gate"
    ],
    "highlightLinkTypes": [
      "reviews",
      "escalates-to"
    ],
    "duration": 0
  },
  {
    "id": "act5-new-roles",
    "title": "Roles That Do Not Exist Yet",
    "narration": "Some of the most important roles in this system do not exist in most marketing organizations today. The Context Engineer maintains the knowledge graph — the taxonomy, scoring matrices, and semantic relationships that make every agent effective. This role is to agentic marketing what the data engineer was to the analytics revolution — the role that makes everything else possible.",
    "cameraPosition": {
      "x": -40,
      "y": 0,
      "z": 480
    },
    "cameraLookAt": {
      "x": -40,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-emerging-roles",
    "filterNodeTypes": [
      "step",
      "gate",
      "input"
    ],
    "highlightLinkTypes": [
      "uses",
      "reviews"
    ],
    "duration": 0
  },
  {
    "id": "act6-close",
    "title": "A Different Way of Working",
    "narration": "The question is not whether to adopt AI. It is whether you treat it as a collection of productivity tools or as an operating system. Productivity tools give you incremental gains — each person gets a little faster. The operating system gives you structural advantage — the system gets smarter, the knowledge infrastructure compounds, and the humans do higher-leverage work. The marginal cost of the next piece of content approaches zero. The marginal value of the next knowledge graph update increases with every agent that uses it. That is not a technology experiment. That is a platform investment.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 520
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-operating-model",
    "duration": 0
  }
]
