[
  {
    "id": "act1-title",
    "title": "The Content Production Lifecycle",
    "narration": "",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 800
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-title-slide",
    "duration": 0
  },
  {
    "id": "act1-lifecycle",
    "title": "The Marketing Lifecycle",
    "narration": "Every marketing team draws the same pipeline: Strategy, Create, Review, Publish, Measure, Optimize. Six stages, left to right. Clean columns. But behind each stage are teams, handoffs, and dependencies — and the complexity compounds fast. Thirty-one steps, not six. This is the operational reality most process documents never show.",
    "cameraPosition": {
      "x": -60,
      "y": 30,
      "z": 380
    },
    "cameraLookAt": {
      "x": -60,
      "y": 30,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-teams-by-phase",
    "filterNodeTypes": [
      "step"
    ],
    "highlightLinkTypes": [
      "flows-to"
    ],
    "duration": 0
  },
  {
    "id": "act2-agents-and-context",
    "title": "Adding Agents — And What They Actually Need",
    "narration": "AI agents get overlaid on specific steps — research, drafting, optimization, performance analysis. That is the natural first move, and it works. But what this agent-first approach misses is that the real work depends on context: brand instincts, legal judgment calls, audience intuition that lives in your best people's heads. Most of that intelligence is mundane — routine decisions, everyday judgment calls. Codifying the mundane is exactly the point. When you make the routine explicit, agents can reason over it — and your people focus on work that actually requires them.",
    "cameraPosition": {
      "x": 0,
      "y": -100,
      "z": 450
    },
    "cameraLookAt": {
      "x": 0,
      "y": -100,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "linear",
    "action": "show-agent-dependencies",
    "filterNodeTypes": [
      "input"
    ],
    "highlightLinkTypes": [
      "uses"
    ],
    "duration": 0
  },
  {
    "id": "act3-graph-reveal",
    "title": "It's Not a Pipeline — It's a Graph",
    "narration": "Now add the real structure. Checkpoints. Feedback loops. Escalation paths. Fast-track bypasses. The neat columns dissolve. This is not a pipeline — it is a graph.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 550
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2500,
    "graphState": "full-graph",
    "action": "explode-to-graph",
    "duration": 0
  },
  {
    "id": "act4-intelligence-layer",
    "title": "The Intelligence Layer",
    "narration": "This is the intelligence layer. Twenty inputs capturing how your organization actually works — brand voice, audience understanding, legal frameworks, orchestration rules — each connected to every agent that depends on it. Update one input, and the entire system gets smarter. The agents will become interchangeable — you can swap models next quarter. But the knowledge graph compounds. Refine one input and every agent that touches it improves simultaneously. Agents commoditize. Infrastructure compounds. Your competitors can buy the same models. They cannot replicate the way your organization thinks.",
    "cameraPosition": {
      "x": 60,
      "y": 0,
      "z": 500
    },
    "cameraLookAt": {
      "x": 60,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-infrastructure-vs-agents",
    "filterNodeTypes": [
      "input",
      "agent"
    ],
    "highlightLinkTypes": [
      "uses",
      "performs"
    ],
    "duration": 0
  },
  {
    "id": "act6-close",
    "title": "A Different Way of Working",
    "narration": "To take humans out of the loop on routine work, you first have to codify that routine — extract the patterns, the decision logic, the ways of working that nobody has ever written down. That is the unglamorous work. But once the mundane is structured, agents handle it — and humans move to strategy, creative direction, and judgment. Someone needs to own this intelligence layer. The Context Engineer — the person who structures and evolves the operational knowledge that makes every agent effective. This role is to AI-driven marketing what the data engineer was to the analytics revolution. The question is not whether to adopt AI. It is whether you do the work of codifying how your organization actually operates and structure it so the entire system can reason over it. That codification is the transformation. The knowledge compounds. The advantage compounds.",
    "cameraPosition": {
      "x": 0,
      "y": 0,
      "z": 520
    },
    "cameraLookAt": {
      "x": 0,
      "y": 0,
      "z": 0
    },
    "cameraTransitionMs": 2000,
    "graphState": "full-graph",
    "action": "show-operating-model",
    "duration": 0
  }
]
